Examinator/src/Catalogs/ФайлыСУЗ/ФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайловСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументовСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ЗависимыеРесурсыСУЗ/ЗависимыеРесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗависимыеРесурсыСУЗ</name>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Модуль</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Дополняет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополняетAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ФайлыСУЗ/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Устанавливает уникальное имя файла в ресурсе
//
Процедура УстановитьУникальноеИмяФайла() Экспорт
	
	ДеревоФайловРесурса = Справочники.РесурсыСУЗ.ДеревоФайлов(Владелец);
	
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		
		ФайлыТекущегоУровня = ДеревоФайловРесурса.Строки;
		
	Иначе
		
		РодительВДереве = ДеревоФайловРесурса.Строки.Найти(Родитель, "Ссылка", Истина);
		
		Если РодительВДереве <> Неопределено Тогда
			ФайлыТекущегоУровня = РодительВДереве.Строки;
		Иначе
			ФайлыТекущегоУровня = ДеревоФайловРесурса.Строки;
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого Строка Из ФайлыТекущегоУровня Цикл
	
		Если Ссылка <> Строка.Ссылка И ИмяФайла = Строка.ИмяФайла Тогда
			ИмяФайла = "Copy_" + ИмяФайла;
			УстановитьУникальноеИмяФайла();
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Текст = НСтр("ru = 'Задайте имя файла'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
	
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			Текст = НСтр("ru = 'Задайте наименование файла'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(ТипФайла) Тогда
			Текст = НСтр("ru = 'Задайте тип файла'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
		Если ТипФайла = Перечисления.ТипыФайловСУЗ.Media И (НЕ ЗначениеЗаполнено(Ширина) ИЛИ НЕ ЗначениеЗаполнено(Высота)) Тогда
			Текст = НСтр("ru = 'Укажите размеры медиаобъекта'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Делаем проверки
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	// Устанавливаем обязательные реквизиты
	
	Если НЕ ЭтоГруппа Тогда
		ТипОбъектаСУЗ = Перечисления.ТипыОбъектовСУЗ.file;
	КонецЕсли;	
	
	Если ТипФайла = Перечисления.ТипыФайловСУЗ.DataProcessor Тогда
		ОткрыватьВнешнимПриложением = Истина;
	КонецЕсли;	
	
	// Проверяем имя файла
	
	Если ИмяФайла = "page_scripts.js" Тогда
		Текст = НСтр("ru = 'Имя файла ""page_scripts.js"" зарезервировано для служебных нужд'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ПропуститьКонтрольУникальностиИмениФайла") Тогда
		УстановитьУникальноеИмяФайла();
	КонецЕсли;	
	
	// Проверяем расширение
	
	Если ЭтоНовый() И НЕ ЭтоГруппа Тогда 
		
		МассивРазрешенныхРасширений = РазработкаСУЗПовтИсп.ПолучитьМассивРазрешенныхРасширенийФайлов();
		
		Если МассивРазрешенныхРасширений.Количество() > 0 Тогда
			
			ФайлТип = Новый Файл(ИмяФайла);
			РасширениеФайла = НРег(СтрЗаменить(ФайлТип.Расширение, ".", ""));
			
			Если ЗначениеЗаполнено(РасширениеФайла) И МассивРазрешенныхРасширений.Найти(РасширениеФайла) = Неопределено Тогда
				Текст = НСтр("ru = 'Файл с расширением "".%1"" запрещено загружать'");
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, РасширениеФайла);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;		
		
	// Создаем владельца, если он не задан	
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
	
		ВладелецОбъект = Справочники.РесурсыСУЗ.СоздатьЭлемент();
		ВладелецОбъект.Наименование = Наименование;
		
		Если ДополнительныеСвойства.Свойство("РодительРесурса") Тогда
			ВладелецОбъект.Родитель = ДополнительныеСвойства.РодительРесурса;	
		КонецЕсли;
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ВладелецОбъект);
		
		ВладелецОбъект.Записать();
		
		Владелец = ВладелецОбъект.Ссылка;
		
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Делаем проверки
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	// Обновляем владельца
	
	ВладелецОбъект = Владелец.ПолучитьОбъект();
	
	Если ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
		
		ВладелецОбъект.ФайлЗапуска = Ссылка;
		ВладелецОбъект.ПодключитьAPI = Истина;		
		
	КонецЕсли;	
		
	ЕдинственныйФайлРесурса = Справочники.РесурсыСУЗ.ЕдинственныйФайлРесурса(Владелец);
	
	Если ЗначениеЗаполнено(ЕдинственныйФайлРесурса) Тогда
		ВладелецОбъект.ЕдинственныйФайл = ЕдинственныйФайлРесурса;
	Иначе
		ВладелецОбъект.ЕдинственныйФайл = Неопределено;
	КонецЕсли;
	
	Если ЕдинственныйФайлРесурса = Ссылка И НЕ ПометкаУдаления Тогда		
		ВладелецОбъект.Наименование = Наименование;		
	КонецЕсли;		
	
	ВладелецОбъект.Записать(); // Плюс всегда будет обновлена дата ресурса
	
	// Обновляем даты тех ресурсов, к которым ресурс-владелец файла подключается

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗависимыеРесурсыСУЗ.Владелец КАК РесурсВладелец
		|ИЗ
		|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
		|ГДЕ
		|	ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ЗависимыеРесурсыСУЗ.Ресурс = &Ресурс
		|	И ЗависимыеРесурсыСУЗ.ДополняетAPI = ИСТИНА";

	Запрос.УстановитьПараметр("Ресурс", Владелец);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РесурсОбъект = ВыборкаДетальныеЗаписи.РесурсВладелец.ПолучитьОбъект();
		РесурсОбъект.Записать(); // Обновляем дату изменения
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры
